{"id":384,"text":"The Pioneer. None. A 30-year-old man was arrested on Friday for allegedly possessing and trying to sell a spotted deer skin and horns in Chhattisgarh’s Dhamtari district.\n\nSpeaking to The Pioneer, Dhamtari Additional Superintendent of Police Manisha Thakur Rawate said the arrested accused identified as Puran Kumar Dhruv, who hails from Dhamtari, presently resides in Gariaband district.\n\nThe accused was apprehended on a tip when he was heading towards Bilbhadar road in Nagri police station area in Dhamtari, the officer said.\n\nA spotted deer skin and 2 horns were found in a gunny bag in the luggage box of his motorcycle (CG-05, E-3101), she added.\n\nPolice seized them along the motorcycle used in the crime. The police are investigating where the accused got the skin, she added.\n\nA case under the Wildlife Protection Act has been lodged against the accused."}
{"id":386,"text":"Hindustan Times. 2021-12-18 20:32:09+05:30. The Property Cell of the Thane Police Crime Branch, on Friday, arrested 2 accused for allegedly smuggling ambergris, also known as whale vomit, worth Rs 10000000.0.\n\nAccording to the officers, the accused were arrested on the basis of a tip off received earlier in the week, according to which some people were bringing a large quantity of ambergris near AP Shah College in Kasarvadavli.\n\n“We laid a trap and detained 2 suspects. A search of their belongings revealed around 750g of ambergris,” police inspector Anil Honrao, Property Cell, said.\n\nThe accused, identified as Sushant Behra (32) and Manoj Sharma (40), were subsequently placed under arrest and charged under the Wildlife Protection Act.\n\nThe accused and the seized contraband were subsequently handed over to the Kasarvadavli police for further investigation.\n\n“The accused have been remanded in our custody for 5 days. We are probing further to find out the source of the ambergris as well as who they intended to sell it to,” senior police inspector Rajesh Babshetty, Kasarvadavli police station, said."}
{"id":390,"text":"TOI. None. HYDERABAD: Forest officials on Thursday busted an organised pangolin poaching and smuggling racket after receiving a tip-off from reliable sources about the ongoing trade in Telangana . After a week-long investigation into the crime, forest personnel seized over 200 pangolin scales, a knife, 1 fake pistol and arrested 3 persons hailing from Golleti village in Rebanna mandal of Komaram Bheem Asifabad district.A 10-member team of the forest department headed by district forest officials of Asifabad formed teams to investigate organized wildlife crime. Pangolins fall under the list of critically endangered as per appendix – 1 of CITES and are also listed under Schedule – 1 in Wildlife Protection Act. Hunting and trading of it is a serious offence and punishable with minimum punishment of 7 years of rigorous imprisonment and a fine of not less than Rs 500000.0."}
{"id":399,"text":"TOI. None. NAVI MUMBAI: The crime branch team from Navi Mumbai has helped the Kerala forest department arrest a man wanted in 5 cases of illegal dealings of transporting captive elephants to Kerala.The crime branch team traced the accused, V Shaji (55), to Koparkhairane where he was hiding at his brother-in-law’s home and arrested him on February 24.A Mallapuram resident, Shaji used to ferry elephants illegally from other states to Kerala for supplying them in local ceremonies. “Five FIRs were registered against Shaji who was absconding since October last year,” said Yogesh Warkad, regional deputy director of the wildlife crime control bureau (WCCB).A joint team of WCCB and crime branch cops arrested Shaji and produced him before the Vashi JMFC court. The WCCB officers obtained his transit remand on February 26 and took him back to their state where he was remanded to 14 days of judicial custody till March 3."}
{"id":400,"text":"Hindustan Times. 2021-09-15 08:07:53+05:30. Snake venom estimated to be worth Rs 1700000000.0 has been seized from many districts of West Bengal since 2017. 1 such consignment was seized last week, bearing a familiar yet mysterious tag – Red Dragon Made in France Code No 6097.\n\nThe red dragon code, which means good fortune, has baffled the investigators for over 4 years as they have not managed to get to the kingpins of the illegal trade while carrying out arrest of small-time couriers, caught with venom stored in crystal jars, a wildlife crime control bureau officer said.\n\nSnake venom is believed to be used in traditional Chinese medicines as antidotes and by high-end drug abusers. It has been recovered in states such as Gujarat, Tamil Nadu, Bihar and Punjab in the past few years with Bengal considered the hub of its smuggling. In all these cases, only couriers have been caught and the commonality was the red dragon code.\n\n“We are still not sure about its origin, destination country and end use. What we do know is that it usually enters India through Bangladesh and is meant to be smuggled out through Nepal and Bhutan,” said Agni Mitra, deputy director (eastern region) of Wildlife Crime Control Bureau (WCCB).\n\n1 of the theories considered by investigators suggests that the venom originates from snake farms in Thailand and smuggled through Bangladesh, India and Nepal for its final destination either in China or in European countries. They also believe that in recent years, snake venom was extracted in places such as Tamil Nadu and Bihar for foreign clients and have not ruled out the possibility of it being used as a drug in India.\n\nThe suspicion that the venom was headed to European countries is based on the Made in France label on the jars. In 2017, the Directorate of Revenue Intelligence seized 1 kilogram of cobra venom in Bihar and said it was being smuggled to France from India. However, the directorate officials did not provide any information linking France with the illegal venom business.\n\nLast Friday, the Border Security Force (BSF) seized 3 jars with the same code, containing around 7 kilograms of suspected snake venom in 3 forms – crystalline, liquid and powder. Top officials of the agency said it could cost around Rs 570000000.0 in the illegal market.\n\n“The jar had markings: Cobra SP – Red Dragon – Made in France – Code No 6097. No 1 was arrested since the jars were recovered from an unattended, under construction house at Dakshin Dinajpur in north Bengal,” said a senior officer of the BSF’s north Bengal frontier.\n\nIn February 2021, BSF found snake venom estimated to be worth Rs 240000000.0 from Uttar Dinajpur district, which was being smuggled to Nepal in jars having the same marking. These instances reminded officials of the West Bengal forest department of similar seizures way back in 2017 and 2018 when some of the first consignments were seized in north Bengal.\n\n“Back then, the venoms were seized in crystal glass jars and sealed. They had the same markings: Cobra SP – Red Dragon – Made in France – Code No 6097. We had intercepted at least 11 such jars in 3 consignments and arrested 17 persons from north Bengal,” said a forest official associated with the case. All of them told officials that they were just couriers and knew nothing about the smuggling racket.\n\nIn 1 consignment, 4 kg snake venom was seized, officials said, estimating it to cost between Rs 25–30 crore in the international illegal market. In other cases in 2017-18, venom, estimated to be worth Rs 700000000.0, was found, officials said.\n\nTo find out what type of venom was in the jars, the West Bengal forest department sent at least 20 jars to the Haffkine Institute for Training Research and Testing in Mumbai, which confirmed it to be snake venom. A former official at the Haffkine Institute, on the condition of anonymity, said that the jars came sealed with the instruction to use a laser gun to break the seal.\n\n“We had a tough time as we were not sure what was inside it. It could have been anything from venom to explosive to some radioactive material. It was only when the analysts from both the defence research wing and BARC ruled out the presence of radioactive material or explosive that the jars were opened and tested. We found a combination of venoms in various jars,” the official said.\n\nThe analysis by Haffkine Institute made investigators consider the possibility that the venom was being smuggled back to India after some additions to turn it into a high-value drug. The venom in some of the jars was found in powder form, which the investigators believe could be for drug peddling. The jars found in Uttar Dinajpur last week had white powder; sugary crystalline and coca cola colour liquid, making investigators believe that the venom was for use as a party drug.\n\nHowever, arrested couriers claim that the venom comes from Bangladesh and is headed to China via Nepal and Bhutan for use in traditional Chinese medicines.\n\n“In some cases, a booklet was found with the jars, written in Thai language, which led investigators to suspect that the venom could have originated there and in other countries in south-east Asia. It was learnt that some farms in Thailand bred venomous snakes in clay water pots in banana plantations,” said a second WCCB official, who refused to be named.\n\nHe said Indian officials had taken up the matter with their counterparts in China and Thailand in the past with little headway.\n\n“There was, however, no breakthrough. While the Chinese officials said that they produced their own snake venom and had no information of such illegal trade, Thailand officials too denied having any related information,” said the WCCB official quoted above.\n\nWildlife activists are also puzzled about the tag, the smuggling route and the consignment quantity. “The route seems to be rather illogical,” said Tito Joseph, program coordinator of Wildlife Protection Society of India.\n\n“If we assume that Bangladesh is the origin, or even if it is a transit country, then why would someone take a longer route through north Bengal and then through Nepal and Bhutan to reach China when this could be easily done through Myanmar.”\n\nHe said that there were rumours that the snake venom was smuggled for use in drug parties as a substitute for narcotics in India and Nepal.\n\nExperts also said that snake venom is required in very small quantities to produce anti-venom. Venom is injected in horses and when antibodies are produced in sufficient quantities, they are drawn and cultured to produce anti-venom.\n\n“But that is required in very minute quantities and procured legally in India. Several kilos of venom seized over the years could be sufficient to meet the world’s requirement for a few years,” said a senior official of Bengal Chemicals and Pharmaceuticals, which earlier used to produce anti-venom."}
{"id":413,"text":"Hindustan Times. 2021-07-03 01:47:10+05:30. The forest department, along with the wildlife crime control bureau (WCCB), arrested 1 person for illegally smuggling and selling a bag of leopard claws and teeth at Delhi’s Kashmere interstate bus terminus (ISBT) on Friday.\n\nAditya Madanpotra, deputy conservator of forests (north division), said, acting on a tip-off, the team -- projecting themselves as prospective buyers -- met the man at Kashmere Gate ISBT around 7am on Friday and caught him with a bag of leopard claws and teeth.\n\n“The seller has been arrested and the parts have been seized,” said Madanpotra.\n\nHe said the department is not going to release the price of the animal parts in the illegal market, because the Wildlife (Protection) Act prohibits making such information public.\n\nThe Indian leopard has been listed as a vulnerable species on the International Union for Conservation of Nature (IUCN)--an international organization working in the field of nature conservation and sustainable use of natural resources-- because of its depleting population. Poaching of the animal for the illegal trade of its skin and other body parts is strictly banned.\n\nForest officials said such illegal trade and transit has increased over the last few years and teams are often on alert to track such criminals. The operation often involves coordination from forest and wildlife departments from other states as well.\n\nA senior forest department official explained that even though Delhi is not a hub for wildlife-related crimes, it is an important transit 0 from where poachers and middlemen transport animals, dead and alive, and their body parts.\n\n“After illegally poaching protected animals such as leopards, tigers, crocodiles, and even trading several protected species of birds from the jungles of Madhya Pradesh, Tamil Nadu, Maharashtra, West Bengal among other places, these illegal traders often use Delhi as a transit 0 to take these items further into north east India and then across border to Nepal, Bhutan or China. The black market value of these goods is quite high,” the official explained.\n\nSHARE THIS ARTICLE ON"}
{"id":426,"text":"OdishaTV. None. Dhenkanal: 5 poachers were arrested by the officials of Dhenkanal Forest division on Sunday. 4 country-made guns, 2 deer antlers, 100 traps, 3 scales of Pangolin have been seized from their possession.\n\nThe accused have been identified as Naba Balmuchi (21), Budu Balmuchi (27), Ratna Balmuchi (30), Kurupa Baipi (28) and Sanatan Dehury (33) of Dhenkanal.\n\nAll the accused have been booked under Wildlife Protection Act, 1972 on the charges of poaching activities in Kapilash forest range.\n\nThe development comes at a time when there is a rise in poaching activities in Kapilash forest range. Recently the forest department had arrested 2 persons and recovered a live pangolin weighing 15 kilograms from their possession.\n\nThe accused were identified as Ghanshyam Behera (21) and Jitendra Pradhan of Khordha district.\n\nOfficial sources said the duo had caught the pangolin from Kapilash sanctuary some 10 days back and was transporting the animal to Khordha district.\n\nThe Dhenkanal forest department has sought assistance from the Special Task Force of the Crime Branch to bust the pangolin racket as it suspects that more animals have been captured from the Kapilash Sanctuary."}
{"id":428,"text":"TOI. None. SURAT: Forest officials have arrested 3 persons and recovered suspected tiger skin from them at Ushker village in Surat district. The 3 were testing the skin by dipping it in water to confirm if it was real and were in search of a buyer to sell it for Rs 500000.0.Forest officials got the skin tested by a government veterinary officer who opined that the skin was of an animal and it had similarity with tiger skin in look. However, the officer suggested a test from the Wildlife Institute of India , Dehradun, for confirmation. The skin samples will be sent to WII by the forest department.The 3 arrested persons were identified as Jetha Jaha Satiya (25), Dhiru Sama Gamit (54), and Raju Gamit (38). They were nabbed from Satiya’s home. The accused were produced in a local court on Friday and were sent to judicial custody.“Tiger is a protected animal under Schedule 1 of the Wildlife Protection Act and trade of any of its body parts is a punishable offence. During investigation of another crime related to wildlife in Vyara, details of these accused were found and we arrested them,” said a forest official. Satiya told the forest officials that he had bought the skin for Rs 200000.0 and he was yet to pay the money to that person.He was planning to sell the skin for Rs 500000.0 and the other 2 accused were helping him in looking for buyers. They were to get commission.After purchasing the skin, the accused tested it by dipping it in water. “They were told by the seller that it was original. The accused are not aware from where the skin reached Surat,” the official added. The supplier of the skin has been identified and forest officials will arrest him soon.In the past, police had recovered suspected tiger skin in the city. But during tests, it was confirmed that the skin was of a cow and the stripes were painted using black colour. ."}
{"id":430,"text":"The Pioneer. None. The Special Task Force (STF) of the Crime Branch seized a live pangolin and arrested 2 wildlife criminals involved in its illegal trade in a village in Subarnapur district on Sunday.\n\nThe arrested were identified as Ashok Bisi and Jaykumar Patel.\n\nActing on inputs, the STF team, with the help of Binika forest officials, raided a place near Dunguripali Chhak under the Dunguripali police station and rescued the pangolin from the possession of the 2 accused.\n\nLater, the police handed over the pangolin to the district forest officials for safe custody.\n\nThe Indian pangolin is a shy, slow moving, nocturnal mammal. It is a Schedule-I protected animal under the Wildlife Protection Act, 1972, under which offenders are made to pay heavy penalties, said the officials."}
{"id":438,"text":"The Hindu. 2021-06-30 09:43:08+00:00. 2 people have been held in connection with the illegal sale\n\n2 people have been held in connection with the illegal sale\n\nThe Forest Department, with the help of conservationists, has rescued a juvenile black kite from the possession of an illegal trader in the city on Tuesday. Forest officials have detained 2 persons in connection with the case.\n\nAccording to sources, through informants, conservationists came to know that the trader had purchased a juvenile black kite from someone in the city’s suburbs. The information was provided to the Forest Department and officers nabbed the trader. Based on information provided by the trader, they then nabbed a man who had purchased the scheduled bird from him. The Forest Department has imposed a fine on the duo.\n\nMeanwhile, conservationists said that the information about the availability of such birds is circulated through social media and message sharing groups. “It is illegal to buy/sell or keep such scheduled birds or animals at home. But this is still happening in the State due to lack of awareness,” said Sadiq Ali, founder/trustee, Wildlife and Nature Conservation Trust. He added that a few months ago they rescued a hawk from the suburbs. “We made a similar rescue in Coonoor too. The thieves climbed a mobile tower and took some fledglings and sold them for Rs 15,000 per pair. We have made many such rescues,” he said.\n\nDuring COVID-19, many children have been demanding pets, especially birds. “Hence the trading of scheduled animals and birds is increasing. Many parents are trying to procure Himalayan and Rose Ringed Parakeets for their kids. This is because they do not know it is illegal and it is an offence to purchase such birds. Sufficient awareness should be created about the Wildlife Protection Act,” Mr. Ali added.\n\nWith illegal sales of scheduled birds and animals increasing, conservationists have stressed the need for exclusive wildlife forest stations across She state that can tackle such crimes. “The government should have a dedicated cyber wing for this, as most of the deals are made online. We will be making a request to Chief Minister M K Stalin soon,” said Mr. Ali."}
{"id":452,"text":"TOI. None. Bhubaneswar: Wildlife crime continues unabated with the Special Task Force ( STF ) of the Crime Branch on Friday seizing a leopard skin, an elephant tusk and nearly 2 kg pangolin scales from a man in Deogarh district. The accused was identified as Madan Kumar Jayapura (45), a resident of Deogarh district.The crackdown came a day after the STF seized 2 leopard skins from another man in Mayurbhanj district on Thursday.“We acted on a fresh input and raided a place near Telibani on National Highway no. 49 and arrested the accused with the leopard skin, elephant tusk and pangolin scales. Local forest officials assisted us during the raid. The accused appears to be a middleman. We will try to trace the poacher and find out the person, who supplied the wildlife body parts to Jayapura,” an STF officer said.The STF found a bullet wound on the leopard skin, raising suspicion that the leopard might have been gunned down by a poacher.The STF will send the seized wildlife exhibits to the Wildlife Institute of India , Dehradun, for chemical examination.Though the STF’s main mandate is to curb organized crimes and drug trafficking in the state, protection of the endangered wildlife species and crackdown on wildlife smugglers has also remained its focus area. The STF has seized 25 leopard skins, 13 elephant tusks, 7 deer skins, rescued 9 pangolins and seized 16 kg pangolin scales since 2020 till now.Altogether 55 people were arrested during the period for their alleged involvement in the wildlife crimes."}
{"id":454,"text":"UNI. 2022-06-27 03:20:02+00:00. A joint team of Special Task Force (STF) and forest department has rescued 20 ‘langurs’ in the Patan village in Unnao, officials said on Monday.\n\nThe team also arrested 2 persons in the case.\n\nAccording to reports, the langurs were to be smuggled to a poacher in Badaun district.\n\nA case has been registered under the Wildlife Act, 1972, at the Bihar police station in Unnao in this regard. The police have also seized a four-wheeler from their possession.\n\nThe accused confessed that they have been bringing langurs from Unnao and selling them for Rs 8,000 to Rs 10,000. The smugglers have also revealed the names of their accomplices.\n\nBihar police station in-charge Sudhir Kumar told reporters that a raid was conducted by the sleuths of STF and the forest department at a dilapidated structure in the Patan village from where 2 persons were arrested and 20 ‘langurs’, locked in steel cages, were rescued.\n\nThe accused Saddam Beg and Nadeem Khan are residents of Fatehpur district.\n\nHowever, the investigators are yet to ascertain why the langurs were being smuggled.\n\n“As of now, the smugglers revealed that they used to sell the ‘langurs’ to earn their livelihood,” said an STF official.\n\nThis is the third major smuggling incident of ‘langurs’ in the last 5 years, said forest officials.\n\nEarlier, in 2021, about 14 ‘langurs’ were recovered from Badaun. Similarly, in 2018, 14 ‘langurs’ were rescued from smugglers in Shahjahanpur.\n\n20220627-084006"}
{"id":455,"text":"Free Press Journal. None. Vashi resident held by Customs in Rs 150000000.0 red sanders smuggling case | Customs\n\nCustoms officials have arrested a Vashi resident for his alleged involvement in trying to export red sandalwood worth Rs 150000000.0. The customs officials had received intercepted a consignment having over 15000 kilograms of red sandalwood which was meant to be smuggled to UAE.\n\n\n\nThe arrested person has been identified as Sanjay Shinde (41).\n\n\n\nAccording to the customs, based on input received that red sanders wood logs were being attempted to be smuggled out of India through Nhava Sheva port, the customs officials on December 24 examined a consignment that had entered the port for exportation to Jabel Ali port, UAE.\n\n\n\nExamination of the said consignment which was stuffed in 20 feet container in the presence of Wildlife Crime Control Bureau officials, led to the recovery of 15020 kilograms of wood logs of red sandalwood of an estimated value of about Rs 150200000.0. These logs were stuffed in the container in the guise of cargo as 90 ml Empty Glass Bottles. Since there is a prohibition on the export of red sanders in India, the said wood logs were seized, officials said.\n\n\n\n\"Our probe has revealed that the said consignment of red sanders had arrived from Andhra Pradesh and Shinde was the main person behind this smuggling. Shine was summoned for questioning and his statement was recorded after which he was placed under arrest on Friday. He is not cooperating in the investigation,\" said a customs official.\n\n\n\n\"My client had only collected delivery orders and he had no knowledge about trailer containing red sanders,\" said Shinde's defence advocate Ravi Hirani.\n\n\n\nSpeaking about the line of investigation in the case, another customs official said, \"We are probing who was the main supplier of red sanders, who was supposed to receive the said consignment abroad and if Shinde had been doing this illegal export in the past.\""}
{"id":458,"text":"The Hitavada. 2020-12-31 00:00:00. 2 poachers arrested with deer skins in Barela\n\n\n\n\n\nOfficers of WCCB, TSF and Forest with the arrested accused and seized wildlife skins.\n\nStaff Reporter :\n\nA Combined team of Wildlife Crime Control Bureau (WCCB), Jabalpur, Tiger Strike Force and Jabalpur Forest nabbed 2 accused and seized 2 skins of spotted deer and barking deer from them in Barela, on Wednesday. The arrested poachers have been identified as Dharmendra Kumar Kushwaha (23) and Jitendra Kumar Warkade (30), residents of Barela. According to WCCB Jabalpur under the direction of WCCB, Jabalpur, Deputy Director, Abhijit Roy Choudhary and Divisional Forest Officer, Jabalpur Anjana Tirkey a special campaign has been started against persons involved in poaching and wildlife trade.\n\nDuring the campaign, Wildlife Crime Control Bureau Jabalpur received information about 2 suspects who were trying to sell skins of wild animal. Taking prompt action on the information, a team of WCCB, Tiger Strike Force and Jabalpur Forest Department started a secret search. Investigating the case, team learnt that the suspects were sighted at market place near Barela Forest Range Office. Acting on the information, team started a search and succeeded in trapping the 2 suspects when they were riding on a motorcycle.\n\nIn their search, team found 2 skins of spotted deer and barking deer in a bag. Wildlife Crime Control Bureau official informed that names of arrested could not be disclosed for further investigation into the case. Arrested are being interrogated for disclosing the names of other people working in the network of wildlife trade and poaching."}
{"id":461,"text":"News18. 2022-01-19 15:53:53+05:30. 3 suspects were arrested with winter clothes made of rare deer fur from the Barabazar area of Kolkata. Total 27 shawls made of deer fur were recovered from them. They were arrested in a joint operation by the Wildlife Crime Control Cell and the Wildlife Crime Control Bureau.\n\nAccording to the Forest Department sources, the 2 Crime Suppression Branch of the Forest Department received information through sources that some winter clothing vendors were selling clothing illegally in the Barabazar area. The forest department recovered over 300 winter clothes from there. According to forest department sources, about 27 of those garments have been identified as shahtoosh shawls so far.\n\n3 accused Abdul Samad Shah, Asif Ahmed and Sudarshan Kusbaha were arrested in the incident. Sources said that each of them used to come from other States and sell winter clothes in Kolkata.\n\nAccording to forest department sources, this winter garment is mainly made from the fur of Tibetan Antelope aka Chiru deer. This extinct animal was first found in Mongolia but was later found in Tibet. However, as its numbers are dwindling day by day, it is considered an endangered species and its fur-lined winter clothing are banned.\n\nAs the fur of this animal is soft, the winter clothes made with it were very light and smooth. As a result, its market value can be from Rs 5,000 to Rs 30,000. However, even though the shahtoosh shawl was banned, some unscrupulous traders in Kashmir took the shawl to different States and made a lot of money by selling it.\n\nRead all the Latest News, Breaking News and Coronavirus News here."}
{"id":473,"text":"The Hindu. 2021-02-28 19:46:08+00:00. Joint teams of forest and police officials trace absconding accused to Koparkhairane\n\nJoint teams of forest and police officials trace absconding accused to Koparkhairane\n\nA 56-year-old man from Kerala, who had been on the run after 5 cases of smuggling captive elephants were registered against him in that State, has been arrested from Koparkhairane by the Maharashtra Forest Department and the Navi Mumbai Police.\n\nYogesh Nilkanth Warkad, regional deputy director (RDD), Wildlife Crime Control Bureau (WCCB), Western Region, said every elephant in Kerala was tagged and it was not permitted to domesticate elephant from other State. “The accused, V. Shaji, has smuggled many elephants into Kerala and the police there had seized 2 elephants from him after which he went absconding,” he said.\n\nThe information was passed on to the Maharashtra Forest Department by Kerala chief wildlife warden Surendra Kumar. “We started looking for Mr. Shaji, who was wanted in 5 different cases of illegal dealing of live captive elephants registered at Kollam in Kerala and had been absconding for 6 months. Since his mobile was switched off, tracing him was a challenge,” Mr. Warkad said.\n\nMr. Warkad then contacted Deputy Commissioner of Police (Crime Branch) Pravin Kumar Patil and requested his coordination in apprehending the accused.\n\n2 joint teams of WCCB and the Navi Mumbai Crime Branch carried out a search and identified 2 suspected locations.\n\nFinally, on Wednesday, Mr. Shaji was arrested from Koparkhairane. “He was taken to the office of the RDD, WCCB, and later produced before the Judicial Magistrate First Class, Vashi. We obtained a transit remand till midnight of Sunday. Meanwhile, a Kerala Forest Department team reached Navi Mumbai and the accused was handed over to the team on Friday evening,” Mr. Warkad said.\n\nOn reaching Kerala, the accused was produced before the Punalur court in Kollam district. He told the police that he had been staying in a relative’s vacant house in Koparkhairane for the last 1 month.\n\nAs per his identity card, Mr. Shaji is a resident of Pattambi in north Kerala while the cases registered against him are in south Kerala. Further investigations are being conducted by the Kerala Forest Department."}
{"id":484,"text":"TOI. None. MUMBAI: A 36-year-old man was arrested by the Mumbai crime branch with skin of black buck at Ghatkopar Link Road on Wednesday.The arrested accused identified as John Sundarrao Yesamala , is a Sewree resident and is unemployed. According to police inspector Manish Shridhankar , the accused had brought the black buck from Kalyan and wanted to sell it for Rs 1000000.0.Police have booked the accused under various sections of protection of Wildlife Act"}
{"id":489,"text":"OdishaTV. None. Keonjhar: The officials of Anandapur wildlife division in Keonjhar district recovered elephant tusks weighing 19 kg. The seizure was made late last night, official sources said on Tuesday.\n\nThe tusks were seized from Bayapita village under Harichandanpur police limits in the district.\n\n#Keonjhar: Forest dept seizes 19 kg of elephant tusks worth around Rs 1000000.0 from a car near Bayapita village under Harichandanpur police limits. 3 persons detained on charges of smuggling the tusks #Odisha pic.twitter.com/M3L1NhSFUh — OTV (@otvnews) September 1, 2020\n\nActing on a tip-off, the forest officials carried out a raid while the tusks were being smuggled in a car. As many as 14 tusks, 4 cellphones and the Hyundai car were seized during the raid. 3 persons involved in the smuggling have been detained.\n\nAmong the arrested, 1 hails from Keonjhar, 1 from Jajpur and another from Bhadrak district.\n\nAccording to the forest officials, the market price of the tusk is around Rs 1000000.0. Further investigation into the matter is underway.\n\nThe forest officials are yet to reveal the source of the tusks procurement and their smuggling destination. It is suspected that the tusks belonged to 3 adult elephants. The officials also suspect that there is a racket behind the wildlife smuggling.\n\n(Edited Suryakant Jena)\n\nRead More: ‘Ivory Smuggling’ Behind Elephant Deaths In Odisha; PCCF Demands Crime Branch Probe"}
{"id":508,"text":"The Pioneer. None. The trafficking of the endangered pangolin continues unabated in the State despite the multiple seizures and arrest of wildlife smugglers. In an example, the Special Task Force of Crime Branch on Thursday arrested 3 persons while they were striking a deal to sell a live pangolin in Bhubaneswar.\n\nOn a tipoff, the STF team conducted a raid near Kalinga Studio Chhak, in the city about a deal of sale of live pangolin by wildlife smugglers.\n\nThe team areested Chitrasen Sahoo of Badamba in Cuttack district, Khageswar Sahoo of Patrapda in Bhubaneswar and Bhagirathi Behera of Ganjam and during search, 1 live pangolin and other incriminating materials were seized from the trio’s possession. As the accused persons could not produce any valid authority in support of the possession of live scaly-skinned mammals, they were arrested. A police case under Sections of 379/411/413/120(B) IPC and Section 51 of the Wild Life (Protection) Act, 1973 was registered against the accused. The pangolin would be handed over to DFO, Chandaka WildLife Warden for safe custody, the STF said.\n\nIn 2020, the STF, launched crackdowns against wildlife smuggling and arrested 32 smugglers while seizing as many as 15 leopard hides, 9 elephant tusks, 2 deer skins, 4 live pangolins, and 13 kg pangolin scales."}
{"id":525,"text":"The Sentinel. 2020-10-13 09:12:25+05:30. A large number of snake and lizard specimens, bones, and skins of dead reptiles were seized from a researcher in Guwahati on Sunday. Following a tip-off, a team from the Wildlife Crime Control Branch and the Forest Department of Assam conducted a surprise raid in Guwahati's Lachit Nagar and recovered a large number of bones and skins of dead reptiles from the residence of herpetologist Dr. Jayaditya Purkayastha, a renowned researcher working on reptiles.\n\nSome of the seized species are protected under the Wildlife Protection Act.\n\nAs per the source of Wildlife Crime Control Branch, Dr. Purkayastha, who was conducting research on snakes, kept a large number of reptiles of different species in his residence.\n\nThe team recovered Burmese pythons, King Cobra, Lizards, rare species of crab snakes, and other venomous snakes and other reptile species of wild animals.\n\nOn being asked about the possession, Dr. Purkaystha claimed that the skins and bones of dead reptiles had been stored for his research purpose. However, the researcher failed to show the team any valid documents of his research.\n\nBoth the Forest department and WCCB have registered a case and will continue the further investigation.\n\n\n\nAccording to Wildlife Crime Control Branch officials, there could be a large racket of animal body part smuggling.\n\nThe official further said that the matter came to light when a person carrying reptile specimens was apprehended at the LGBI Airport on Saturday and during his interrogation, he confessed that he was carrying the samples from Dr Purkayastha.\n\nAlso Read: Meghalaya: GSMC urges Tura DC to postpone Wangala festival 2020"}
{"id":529,"text":"IANS. 2022-09-07 03:40:15+00:00. The Uttar Pradesh Special Task Force (STF) and the state forest department have seized ambergris — a solid waxy substance originating in the intestine of the whale — worth Rs 100000000.0 and arrested 4 persons in connection.\n\nSTF sleuths posed as customers and requested the alleged accused to deliver goods at their doorstep.\n\nIn a statement, the STF said that Firoz Ahmad, Danish Akhtar, Avanish Kharwar and Abhay Kharwar were arrested from Janeshwar Mishra park.\n\nThey were involved in smuggling of ambergris which is prohibited under the Wildlife Act of 1972.\n\nThe STF said that the price of 1 kg ambergris is Rs 20000000.0 in the international market. The accused were found to be in possession of 4.2 kg.\n\nASP, STF, Vishal Vikram Singh said that during interrogation the accused revealed that 1 Tufael, a resident of Mumbai, had asked Firoz of Pratapgarh to sell ambergris which he had found on the shore.\n\n“Firoz roped in his friends which include Danish Akhtar, Avanish Kharwar and Abhay Kharwar,” said Singh.\n\nFiroz gave an advertisement about the same online, with the code ‘High-end SUV’, on social media.\n\nThe STF said that they were alerted by the Wildlife Crime Control Bureau (WCCB) about this suspicious advertisement.\n\nMost of the animals or their skin sold online have code words like double engine, scooter, four-wheeler, pipe, aaloo (potato), pyaaz (onion), dhariwala chaddar and chhota dhariwala chaddar.\n\nAn officer said that WCCB alerted them and the forest department about the deal as the seller belonged to Pratapgarh.\n\n“In coordination with the STF, we laid a trap and posed as a perfumes manufacturer based in the middle east but asked them to meet us with a sample at Janeshwar Mishra park. 1 of the accused, Danish, came with a small sample and was held,” said Ravi Kumar Singh, Lucknow DFO.\n\nHe was nabbed and a call was made that the deal was done so others with the consignment were asked to come for the deal and were arrested.\n\nAmbergris is derived from the old French words Amber and Gris, which means grey amber, although it is commonly referred to as whale vomit.\n\nThe substance is created by the bile duct in the intestines of the sperm whale secreting bile and it is frequently discovered floating on the water or washing up on the coastlines.\n\nAmbergris can be found in the stomachs of dead sperm whales.\n\nAmbergris is traditionally used as a fixative in the perfume industry, highly prized due to its ability to ‘fix’ a scent on the human skin.\n\n20220907-090205"}
{"id":530,"text":"TOI. None. ‘E-trade sites roped in to prohibit sale’\n\nBHOPAL: The Madhya Pradesh STF (wildlife) has busted a gang involved in trade in pangolin scales and other wildlife articles through YouTube and got the videos removed under Operation Wildnet-III.Three people have been arrested following searches in Indore, Ujjain, Sagar and Shivpuri, and 2.7 kg of pangolin scales recovered.Investigating officers asked YouTube to remove the videos through which the racketeers were allegedly attracting buyers of prohibited articles. “Now, all the links we shared with YouTube are either blocked or have been removed,” said an officer.Operation Wildnet was first envisaged by Wildlife Crime Control Bureau in May 2017, to tackle the increasing threat of online wildlife trade and turn enforcement agencies’ attention towards internet deals of scheduled species.The operation has notched up a string of successes.In November 2019, a monthlong multiagency operation helped recover a large number of scheduled species being traded online, using online business portals and social media platforms, said an official release.As a follow-up operation, the bureau met representatives of online trade platforms to reach a consensus on sharing of information on sale of such prohibited artefacts.OLX even ran a pictorial awareness campaigns on its webpage in coordination with WCCB.On August 26, a joint team of WCCB, Madhya Pradesh forest department and Madhya Pradesh police STF seized rare sea shells, 124 pieces of sandalwood and 2 packets of red sanders and arrested a suspect from Jabalpur."}
{"id":531,"text":"IANS. 2022-03-18 08:40:05+00:00. Some 709 endangered turtles were seized in Uttar Pradesh’s Aurraiya district, police said, adding that 1 person has been arrested in connection.\n\nActing on specific inputs, police raided a hideout in Kiratpur village of Tawli area and arrested the man with a large consignment of turtles.\n\nASP Shishya Pal said the accused has been identified as Suraj from whose possession 709 turtles were recovered.\n\n“The information about the recovered turtle has been given to the forest department officials,” the ASP further said.\n\nRegional forest officer Komal Singh rushed to the spot and started investigations which revealed that the accused is a wildlife smuggler.\n\nPolice and the forest department teams are interrogating him to procure more information about his gang.\n\nSmuggling of endangered turtles has become rampant particularly in the Etawah-Mainpuri and Aurraiya districts.\n\nThe reptiles, which are considered a delicacy, are also used for medicinal purposes in the northeastern part of the country.\n\nMeanwhile, a case has been registered against the arrested man under relevant sections of the Wildlife Protection Act.\n\nThe investigators claimed that the arrested man during, preliminary round of investigation, had confessed to smuggling turtles earlier on several occasions.\n\n20220318-140403"}
{"id":532,"text":"The Hindu. 2021-12-19 18:02:13+00:00. The Kanakapura police arrested a 29-year-old man who was allegedly trying to sell a pair of elephant tusks weighing 25kg. The seized tusks have been handed over to the Forest Department, said the police.\n\nThe arrested man has been identified as Mariswamy, who hails from Chamarajanagar. A senior police officer said that after receiving a tip-off, the police caught Mariswamy near Ramanagaram around 4.30 a.m. on Sunday when he arrived to sell the 2 tusks.\n\n“Forest Department officials received a message about Mariswamy’s activities and alerted the police. We caught him while he was waiting for a buyer from Nelamangala,” said a police officer.\n\nThe police suspect that he is part of a gang of poachers who kill elephants and other animals whose pelts and tusks are coveted by buyers. Mariswamy was booked under various sections of the Wildlife Act. “We have taken him into custody and are identifying his associates and his network,” the police officer added.\n\nThough he claimed that it was his first time, the police suspect that he is a habitual offender."}
{"id":542,"text":"TOI. None. KODERMA: Personnel of the Railway Protection Force RPF ) found 115 Indian flapshell turtles in an unclaimed bag at the Koderma railway station on Sunday after they received a tip-off about the smuggling of the reptiles, officials said. Jawahar Lal , officer-in-charge of RPF police station, said, “No arrests have been made and the turtles have been handed over to the forest department .”Divisional forest officer Suraj Kumar Singh said, “The range officer has been asked to investigate the matter properly with the help of the railway police. We have to find the smuggling route and the people behind the crime. Our personnel will take proper care of the seized turtles and they will be sent to the nearest habitat for rehabilitation before their release. Indian flapshell turtles are freshwater turtles and are protected under Schedule 1 of the Wildlife Protection Act , 1972.”"}
{"id":546,"text":"OdishaTV. None. Subarnapur: The Special Task Force (STF) of Odisha police Crime Branch busted a pangolin smuggling racket and rescued a pangolin from Mahanadi Bridge near Rajakothi here in the district on Friday and arrested 2 persons for possessing the animal illegally.\n\nBoth the smugglers have been identified as Somnath Bag and Marsalan Bhengera of Ulunda under this district.\n\nAccording to sources, a team of the Crime Branch rescued the animal from the smugglers while they were planning to sell it outside the state. The rescued animal was later handed over to Sonepur Forest Division.\n\nThe STF team also seized pangolin scales weighing 5 kg 65 gram from their possession. A case has been registered in this matter under the Wildlife Protection Act, 1972.\n\nSources said, the Indian pangolin has been listed as 'endangered'. Pangolins are often termed as the world’s most trafficked mammal. Their scales are used in traditional Asian medicine, particularly in China and Vietnam.\n\nThe animal’s scales are made of keratin, the same material that makes human fingernails and hair, and they have medicinal value. Pangolin meat is also considered to be a delicacy in some countries, and the scales are also used as jewellery and decorations for rituals.\n\n(Edited by Suryakant Jena)\n\nRead More:\n\nLeopard Head And Skin, Wild Boar Meat, Pangolin Scales Seized In Odisha\n\nCOVID-19: Pangolin Rescued From Quarantine Centre In Odisha Tests Negative"}
{"id":554,"text":"TOI. None. BHOPAL/JABALPUR: In a major breakthrough, the Wildlife Crime Control Bureau WCCB ) and authorities of the Bandhavgarh Tiger Reserve have busted a gang of poachers.The gang targeted monitor lizards, deer, pangolins and wild boars in the forest close to the protected areas.Skins of 6 monitor lizards, 24 deer horns and pangolin scales were seized from their possession. Teams were led by WCCB's regional deputy director Abhijit Rai Chaudhary, BTR field director Vincent Rahim, DFO (Katni) R C Vishwakarma and SDO O P Singh Baghel, SDO Katni.These officials had intelligence inputs about poachers, who were in search for gullible customers to sell those hides and scales.A decoy was sent with bait money and the accused were nabbed.During their interrogation, they confessed to have killed several endangered animals for their meat, blood and skins.The accused have been charged under sections of the Wildlife Act and state biodiversity act.\"They target lizards during monsoon, when it comes out of rock crevices or burrows. They become victims while basking in the sunlight. Poachers make use of iron rods or just dogs to sniff them out. They are caught by the neck and strangled,\" said the official."}
{"id":557,"text":"TOI. None. JAIPUR: A crime branch unit while acting on an illegal arms supplier stumbled upon a possible network of wildlife traffickers after it recovered 2 antlers of Barasingha (swamp deer) during a raid on Thursday.Additional DCP (crime), Karan Sharma said that the police have arrested 2 accused, Ankit Singh (28), and Arjun Singh (26) from Jaisinghpura Khor. Besides 1 illegal firearm and 7 live cartridges, the team also discovered antlers during their search from the hideout of the accused.“The accused are brothers and claimed to have purchased the firearms for Rs 25,000 from New Delhi. They are drug addicts with a history of snatching chains, mobiles, purses and wallets,” said an official.Police said that they tried to speak to the accused about how they came to acquire antlers but in vain.“The accused were drug-addled and hence, they could not respond to our queries,” said the official, adding that the accused were suspected to be connected with wildlife traders. “It is likely that they had brought it from someone else to sell it to another customer. We are probing the nexus,” the official said.In 2018, the city police had unearthed a similar racket when it arrested 2 accused with tiger skin and fake silver coins.“Previous experience indicates that the wildlife traders often work with other smuggling gangs. Similarly, in this case, the 2 accused may have come across a different gang who slipped them antlers,” said the official.Jaipur police said that they were investigating the accused’s possible network of suppliers for further investigation.“We were acting on information about arms suppliers. But it was only after a complete search of the room that we discovered the antlers,” said the official."}
{"id":558,"text":"ANI. None. Bhopal (Madhya Pradesh) [India], February 15 (ANI): State Tiger Strike Force, Wildlife Crime Control Bureau, and Madhya Pradesh police's Special Task Force on Monday arrested 16 persons in a joint effort for engaging in leopard hunting, and trading of pangolins' scales, according to a statement by the state Chief Forest Conservator's Office.\n\nThe arrests have been made following a comprehensive strategic action in Katni, Jabalpur, and Dindori districts.\n\n2 accused are residents of Katni, 2 of Jabalpur, 4 of Umaria, and the rest 8 of Dindori districts.\n\n\n\n\"About 20 kilograms of pangolin scale, 4 leopard's skins, 2 four-wheelers, 2 two-wheelers have been recovered from the arrested,\" informed the official statement.\n\nAs per the statement, the investigation of the incident is underway. All the accused have been taken into remand.\n\n\"The accused used to sell body parts of leopards to people for black magic and witchcraft,\" the statement added. (ANI)\n\n"}
{"id":560,"text":"Indian Express. 2015-01-20 17:48:23+05:30. The 4 men came to Bangalore a few months ago on a work permit visa and indulged in smuggling activities.\n\n4 Chinese nationals who allegedly ran a Red Sanders smuggling racket under the guise of a furniture business have been arrested by the Bangalore rural district police. The Chinese men have been accused of smuggling Red Sanders worth more than Rs 180000000.0 in the international market by exporting it out of India in the guise of furniture. The accused persons have been identified as Tan Zi Shui, 51, Tol Shoi Yuan, 45, Yee Shai, 25 and Wei Zhiliang, 27.\n\nThe 4 men came to Bangalore a few months ago on a work permit visa and indulged in smuggling activities, the Inspector General of Police (Central Range) J Arun Chakravarthy said. As part of the investigations of the smuggling racket a police team raided an industrial shed at Pillagumpa Industrial Area near Hoskote town on the outskirts of Bangalore and seized 6 tons of Red Sanders wood.\n\nPolice are investigating the case to identify the role played by locals in the case. The shed where the Red Sanders wood was stored in Hoskote belonged to a person identified as Ramachari who had rented it to a man identified as Rafiq for Rs 38,000 per month, the IGP of the central range stated.\n\n“We are investigating the role of Rafiq in the case,” he said. The police investigation has revealed that the accused persons procured Red Sanders from various sources and stored them in the shed. They created furniture and wooden ornaments with the rare wood and then to smuggled the items to places like China and Japan where Red Sanders attracts a huge value.\n\nIGP Chakravarthy said that the Bangalore rural district police worked closely with the Andhra Pradesh police, Delhi police and the Wildlife Crime Control Bureau (WCCB) for investigating the case. The police have taken up a case under various sections of the Karnataka Forest Act, the Karnataka Forest Rules and the Indian Penal Code. A police sub-inspector and a head constable from the Sulibele police station under whose jurisdiction the smuggling racket was operating have been suspended on charges of dereliction of duty."}